{
  "channel": "Vespa AI",
  "channel_url": "https://www.youtube.com/@vespaai/videos",
  "total_videos": 20,
  "videos": [
    {
      "video_id": "1rOO9lqBwuY",
      "title": "Vespa - 2025 Year in Review",
      "description": "Join us for an exclusive look at Vespa innovations of 2025, now available to power your next generation of Retrieval-Augmented Generation (RAG), real-time search, and personalization experiences. You’ll hear directly from Vespa engineers, see new capabilities in action, and learn how teams like Perplexity, Vinted, and Onyx are driving real production value with Vespa today.\n\nYou’ll get the inside scoop on enhancements for:\n\nQuery & Indexing Performance\nRanking, Retrieval & Hybrid Search\nVector/T",
      "url": "https://www.youtube.com/watch?v=1rOO9lqBwuY"
    },
    {
      "video_id": "1NBjbtfkLIg",
      "title": "How Hidden Search Problems Derail Great Products",
      "description": "This episode features Ravindra Harige, Founder of Searchplex. We explore a common but often misdiagnosed issue in modern software: search problems hiding in plain sight. \n\nWhen users struggle with irrelevant results, poor UX, or high bounce rates, teams typically reach for the usual fixes—frontend tweaks, more testing, or scaling infrastructure. But in many cases, the real issue isn’t performance or design. It’s search.\n\nWe unpack why so many teams miss the mark, how conventional roles (frontend",
      "url": "https://www.youtube.com/watch?v=1NBjbtfkLIg"
    },
    {
      "video_id": "iIWG3_zbSzQ",
      "title": "Vectors Explained - as non-technical as we could!",
      "description": "How do you explain vectors and vector search in as non technical way as possible? Well, our brilliant engineer Jan was given this task at our recent company gathering, and we thought he did a pretty good job of it! So we decided to film at share it with you all! \n\nHow would you go about explaining vectors and vector search?\n\n#aisearch #vectors #embedding",
      "url": "https://www.youtube.com/watch?v=iIWG3_zbSzQ"
    },
    {
      "video_id": "osufpkpVnpU",
      "title": "Migrating from Elasticsearch to Vespa.ai",
      "description": "Modern applications need real-time AI search that unifies vectors, text, and structured signals—with the flexibility to customize ranking, integrate multiple models, and run ML inference at scale. Vespa was built for exactly this.\n\nMigrating from Elasticsearch is simpler than you think, and it unlocks a platform where hybrid retrieval, multi-phase ranking, and machine learning come together natively, without external workarounds.\n\nGuest speaker Ravindra Harige, long-time search expert and founde",
      "url": "https://www.youtube.com/watch?v=osufpkpVnpU"
    },
    {
      "video_id": "NWcV74l1qRE",
      "title": "From Pilots to Precision: RAG and Search in Life Sciences",
      "description": "🚀 AI is transforming life sciences—but not in the way you think.\n\nIn this episode of Vespa Voice, host Bonnie Chase sits down with Harini Gopalakrishnan (former Global CTO of Life Sciences at Snowflake, now at Vespa) to break down how pharma and biotech are really using AI—from drug discovery and clinical trials to regulatory submissions and commercial launches.\n\nWhat you’ll learn:\n👉  From ML → GenAI → retrieval-first AI in life sciences\n👉  Why search is key to stopping hallucinations\n👉  Using m",
      "url": "https://www.youtube.com/watch?v=NWcV74l1qRE"
    },
    {
      "video_id": "D2omjLDq8L0",
      "title": "The CXO Brief: Search Reimagined for AI Workloads",
      "description": "In this episode, Bonnie Chase sits down with Whit Walters, Field CTO at GigaOM, to dive into the newly released CXO Decision Brief on the future of search and AI infrastructure. They explore:\n\n- The risks of delaying modernization and how technical debt has become a competitive debt\n- Best practices for pilots, quick wins, and upskilling teams to adopt AI-native platforms\n- Where the market is heading in the next 2–3 years as companies move beyond Lucene-based engines\n- How Vespa’s architecture ",
      "url": "https://www.youtube.com/watch?v=D2omjLDq8L0"
    },
    {
      "video_id": "-1_BYHSxMbo",
      "title": "Vespa Architecture Overview",
      "description": "Vespa.ai is most capable AI search platform in the world. Instead of collecting signals from multiple sources, Vespa allows you to model all of your data together, be it tensors, vectors, text or structured metadata. This enables Vespa to do real-time inference and updates on the data on the node, including using machine-learned models for ranking and retrieval. No more network bottlenecks, and infinite scaleability.\n\nVespa frees you to innovate relentlessly at scale.\n\nWhat will you build?\n\n\n\n\n\n",
      "url": "https://www.youtube.com/watch?v=-1_BYHSxMbo"
    },
    {
      "video_id": "kaFDpIwY9F0",
      "title": "Getting Started with Vespa AI Search",
      "description": "In this tutorial we walk you through the steps to build your first Vespa application in Python. The video is based on the getting started tutorial in the link bellow, so if you want more details, want to copy the code, or just prefer the notebook format then you can follow the link bellow!\n\nhttps://blog.vespa.ai/vespa-quickstart-how-to-set-up-an-application-with-vespa/\n\nThe tutorial covers:\n- Setting up of your Vespa Cloud account\n- Preparing your data\n- Creating a Vespa application package\n- Co",
      "url": "https://www.youtube.com/watch?v=kaFDpIwY9F0"
    },
    {
      "video_id": "ifpDE3JqUmE",
      "title": "Clinical Example with ColPali",
      "description": "See how Vespa can find contextually relevant information within complex, multimodal content.",
      "url": "https://www.youtube.com/watch?v=ifpDE3JqUmE"
    },
    {
      "video_id": "rz6bTH7-Pic",
      "title": "Beyond Chat: The Hidden Use Cases Driving the GenAI Revolution",
      "description": "In this episode of Vespa Voice, Bonnie Chase sits down with Kamran Khan, CEO of Pureinsights, to explore the evolving role of search in the GenAI era. With decades of experience in enterprise search, Kamran shares how keyword search has evolved into hybrid, vector, and multimodal search—and how Retrieval-Augmented Generation (RAG) and agentic AI are reshaping enterprise applications.\n\nYou’ll hear real-world use cases, including:\n\n- A “Shazam for cars” that uses audio search to diagnose engine is",
      "url": "https://www.youtube.com/watch?v=rz6bTH7-Pic"
    },
    {
      "video_id": "ztg9Bc_WfPQ",
      "title": "From Minutes to Milliseconds: Vinted's Migration to Vespa Explained",
      "description": "In this episode, we sit down with Ernestas Poškus, Engineering Manager at Vinted, Europe’s largest platform for secondhand fashion. Ernestas shares how Vinted migrated from Elasticsearch to Vespa to overcome scalability challenges, reduce infrastructure costs, and improve both query and indexing latency—all while serving over a billion items.\n\n💡 Learn how Vinted:\n\nAchieved 2.5x faster search performance\n\nCut infrastructure costs in half\n\nReduced indexing latency from 5 minutes to 5 seconds\n\nPowe",
      "url": "https://www.youtube.com/watch?v=ztg9Bc_WfPQ"
    },
    {
      "video_id": "su81gUdW1w8",
      "title": "The RAG Blueprint Overview",
      "description": "Retrieval-Augmented Generation (RAG) sounds simple: fetch relevant info, pass it to a large language model, and generate an answer. But at scale—when you're dealing with billions of documents and millions of users in real time—things get a lot more complex.\n\nThat's where The RAG Blueprint comes in - a modular, ready-to-deploy starting point for building high-performance RAG systems. We’ve taken best practices we’ve learned along the way in building these systems with our customers, like Perplexi",
      "url": "https://www.youtube.com/watch?v=su81gUdW1w8"
    },
    {
      "video_id": "7jaaxTNUz-o",
      "title": "(Vespa Voice) The Future of RAG: Search, Vision Language Models, and Agentic Workflows",
      "description": "In this episode of Vespa Voice, Bonnie Chase sits down with Jo Kristian Bergum to explore the paradigm shift in information retrieval—from keyword matching to hybrid search and now, to vision-language models (VLMs).\n\nLearn how VLMs and methods using ColPali are revolutionizing retrieval pipelines by enabling multimodal search across complex formats like PDFs, scanned documents, and visual-heavy manuals. From IKEA assembly guides to enterprise knowledge bases, Jo Kristian explains how \"what you s",
      "url": "https://www.youtube.com/watch?v=7jaaxTNUz-o"
    },
    {
      "video_id": "JE-HyA1Ig7c",
      "title": "(Vespa Voice) The Rise of Vector Databases: Breaking Down GigaOm's Sonar Report",
      "description": "In this episode, we chat with Whit Walters, Field CTO at GigaOm, and dive into GigaOm’s latest Sonar Report on vector databases, exploring why Vespa.ai is recognized as both a Leader and Fast Mover in the space. We break down what sets Vespa apart—from its integrated architecture that runs data, indices, metadata, and machine learning inferences on the same physical nodes, to its unmatched performance at scale.\n\nWe explore how Vespa’s support for lexical, vector, and hybrid search methods gives ",
      "url": "https://www.youtube.com/watch?v=JE-HyA1Ig7c"
    },
    {
      "video_id": "X1SLneDtreQ",
      "title": "Vespa.ai - Making AI work for you",
      "description": "Vespa.ai is a platform for developing and running large-scale enterprise AI applications, using big data, RAG, vector search, machine learning and LLMs to deliver fast, precise decisions that drive business success.",
      "url": "https://www.youtube.com/watch?v=X1SLneDtreQ"
    },
    {
      "video_id": "3XWhNjIktZs",
      "title": "Vespa.ai: How to create high-quality Generative AI solutions at an enterprise scale (EM360 Podcast)",
      "description": "\"Ensuring the reliability and effectiveness of AI systems remains a significant challenge. Generative AI must be combined with access to your company data in most use cases, a process called retrieval-augmented generation (RAG). The results from GenerativeAI are vastly improved when the model is enhanced with contextual data from your organization. \n\nMost practitioners rely on vector embeddings to surface content based on semantic similarity. While this can be a great step forward, achieving goo",
      "url": "https://www.youtube.com/watch?v=3XWhNjIktZs"
    },
    {
      "video_id": "mEYZpo4PCZM",
      "title": "Vespa ai: Debugging a Vespa Searcher",
      "description": "Learn how to deploy a Java Searcher that manipulates the user query. Add query trace output for debugging, then use a debugger, stepping through the Searcher code.",
      "url": "https://www.youtube.com/watch?v=mEYZpo4PCZM"
    },
    {
      "video_id": "dUCLKtNchuE",
      "title": "Vespa ai: Troubleshooting startup, singlenode",
      "description": "How to start Vespa in a Docker container, with an overview of relevant Vespa processes. Vespa startup sequence. Verify services are up by using logs and status/health interfaces. The video goes through common pitfalls like bundle load error and troubleshooting.",
      "url": "https://www.youtube.com/watch?v=dUCLKtNchuE"
    },
    {
      "video_id": "BG7XZmXpIzo",
      "title": "Vespa ai: Troubleshooting startup, multinode",
      "description": "How to start a Vespa, using multiple Config Servers. Validate that all servers are started. How Vespa Config Servers use Apache Zookeeper, and check for quorum / leader election.",
      "url": "https://www.youtube.com/watch?v=BG7XZmXpIzo"
    },
    {
      "video_id": "HnhiesF62JY",
      "title": "Vespa ai: Bucket distribution - intro",
      "description": "Intro to document distribution using buckets and Vespa’s ideal state algorithm. Using the Monitoring example application to monitor document distribution. Auto bucket redistribution when increasing capacity. Auto bucket redistribution at node failure.",
      "url": "https://www.youtube.com/watch?v=HnhiesF62JY"
    }
  ]
}